app/controllers/products_controller.rb

  def index
    @products = Product.all
    @prices = Product.select(:price).to_a.map! { |product| product.price }
    @total_stock = Product.sum(:stock_quantity)
---
SELECT "products".* FROM "products"
SELECT "products"."price" FROM "products"
SELECT SUM("products"."stock_quantity") FROM "products"

  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("title", "description", "price", "stock_quantity", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "Tea"], ["description", "Green Tea"], ["price", 5.99], ["stock_quantity", 42], ["created_at", "2015-03-13 16:14:49.288634"], ["updated_at", "2015-03-13 16:14:49.288634"]]

  def update
    respond_to do |format|
      if @product.update(product_params)
---
UPDATE "products" SET "stock_quantity" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["stock_quantity", 15], ["updated_at", "2015-03-13 16:15:27.169432"], ["id", 2]]